Reports/Чемпионы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>Чемпионы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лига</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОчков</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чемпионат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗабито</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЗабито</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПропущено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЗабито</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Чемпионы/Ext/ObjectModule.bsl
Функция ОтчетСформировать() Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(ЗаголовокПолучить());
	
	ПоказыватьРазницуМячей	= СерверныйФункции.ПоказыватьРазницуМячей();
	Команда		= МояКомандаПолучить();
	
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка2"));
	Для Каждого Выборка Из Данные Цикл
		ОбластьМакета	= Макет.ПолучитьОбласть(?(Выборка.Команда=Команда, "Детали3", "Детали2"));
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Разница	= ?(ПоказыватьРазницуМячей, Формат(Выборка.КоличествоЗабито - Выборка.КоличествоПропущено, "ЧГ=0"), СтрШаблон("%1-%2", Выборка.КоличествоЗабито, Выборка.КоличествоПропущено));
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	Возврат ТабДокумент;
КонецФункции

Функция ЗаголовокПолучить()
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат", Лига, Лига));
КонецФункции

Функция МояКомандаПолучить()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
